{
  "title": "Leading a team",
  "text": "For the last year I've been in the World Pulse project as a tech lead. My role, in addition to being a developer, is to make technical decisions, lead the meetings to plan the sprints, distribute the issues among the developers, estimate the issues and deploy hotfixes and sprints. Also, on this project, I had the responsibility of setting up the project from scratch, from the server to the database.",
  "subtitle": "My experience as a developer",
  "previousButtonLabel": "Show previous slide",
  "nextButtonLabel": "Show next slide",
  "experiences": [
    {
      "company": "Globo",
      "text": "Globo is the biggest TV channel in Brazil. I worked in their smart TV app: Globoplay, which has millions of users. This project was very challenging, develop using React for Smart TVs requires a lot of attention on performance and support across multiple manufactures. The app was built using React and the build process was very complex."
    },
    {
      "company": "E-completo",
      "text": "I worked on this project for 3 years, building from scratch a multi-tenant application for car dealers. We had more than 150 sites running. On this project I learned how to reach 100% on Google Lighthouse metrics: SEO, Performance, Accessibility, Best Practices and Progressive Web App. Our sites were all indexed on Google's first page, and also I was responsible for doing all the designs as well. The software was built using Lavavel + MariaDB on the backend, and a Node server with Express consuming the API."
    },
    {
      "company": "Freelancer",
      "text": "I worked for years as a freelancer, and still do. I learned a lot working on a large variety of projects, and also developed a lot of softwares from scratch using different types of technologies, like React, PHP, Node and more. I added some examples on the next step."
    },
    {
      "company": "Bari bank",
      "text": "Bari is a digital bank where me and my team developed their site in 2019 using NextJS. It was one of the first versions of NextJS, and the popularity of the framework wasn't even close to what it is now."
    }
  ]
}
